Autodesk.Revit.DB.TemporaryGraphicsManager.SetVisibility(System.Int32,System.Boolean)
Changes the visibility of temporary graphics object.
index:
Unique index of the temporary graphics object to be updated.
visible:
if true, it will make the temporary graphics object visible.
if false, it will make the temporary graphics object invisible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
Since:
2022

Autodesk.Revit.DB.TemporaryGraphicsManager.UpdateControl(System.Int32,Autodesk.Revit.DB.InCanvasControlData)
Updates the in-canvas control identified by the unique index.
index:
Unique index of the control to be updated.
data:
data to generate in-canvas control appearance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to load the image from specified path.
Since:
2022

Autodesk.Revit.DB.TemporaryGraphicsManager.Clear
Clear all temporary graphics objects managed by this manager.
Since:
2022

Autodesk.Revit.DB.TemporaryGraphicsManager.GetAll
Returns all temporary graphics object indexes managed by this manager.
Returns:
Collection of temporary graphics object indexes managed by this manager.
Since:
2022

Autodesk.Revit.DB.TemporaryGraphicsManager.RemoveControl(System.Int32)
Deletes the existing control identified by the unique index.
index:
Unique index of the control to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
Since:
2022

Autodesk.Revit.DB.TemporaryGraphicsManager.AddControl(Autodesk.Revit.DB.InCanvasControlData,Autodesk.Revit.DB.ElementId)
Creates an in-canvas control.
Remarks:
This method can perform drawing an image (supplied by the caller) as an in-canvas control in the view(s). The control can react on click
by invoking a callback defined in Autodesk::Revit::UI::ITemporaryGraphicsHandler::OnClick(TemporaryGraphicsCommandData).
The caller can use the returned index to update the control (changing image/location), delete and change visibility (hide/unhide) in
response to any events later.
data:
Data to generate in-canvas control appearance.
ownerViewId:
The view in which the control appears. It will show in all views if the id is invalidElementId.
Returns:
Unique index of control for future references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ownerViewId provided is not an id of a view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to load the image from specified path.
Since:
2022

Autodesk.Revit.DB.TemporaryGraphicsManager.GetTemporaryGraphicsManager(Autodesk.Revit.DB.Document)
Gets a TemporaryGraphicsManager reference of the document.
document:
The document.
Returns:
Instance of TemporaryGraphicsManager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.TemporaryGraphicsManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TemporaryGraphicsManager
A class that provides functionality to create temporary graphics in a Revit model.
Remarks:
The graphics created by this class are temporary or transient. They are not subject to undo and are not saved. It's caller's
responsiblity to manage their lifetime, creation and destruction, though Revit will destroy all of them when closing the model.
Since:
2022